#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws-cost-slack.aws_cloudwatch_event_rule.cron_schedule will be created
  + resource "aws_cloudwatch_event_rule" "cron_schedule" {
      + arn                 = (known after apply)
      + description         = "Fires every five minutes"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-five-minutes"
      + schedule_expression = "rate(5 minutes)"
    }

  # module.aws-cost-slack.aws_cloudwatch_event_rule.every_five_minutes will be destroyed
  - resource "aws_cloudwatch_event_rule" "every_five_minutes" {
      - arn                 = "arn:aws:events:us-east-1:589845989135:rule/every-five-minutes" -> null
      - description         = "Fires every five minutes" -> null
      - id                  = "every-five-minutes" -> null
      - is_enabled          = true -> null
      - name                = "every-five-minutes" -> null
      - schedule_expression = "rate(5 minutes)" -> null
      - tags                = {} -> null
    }

  # module.aws-cost-slack.aws_cloudwatch_event_target.cron_schedule_aws_cost_slack will be created
  + resource "aws_cloudwatch_event_target" "cron_schedule_aws_cost_slack" {
      + arn       = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack"
      + id        = (known after apply)
      + rule      = "every-five-minutes"
      + target_id = (known after apply)
    }

  # module.aws-cost-slack.aws_cloudwatch_event_target.every_five_minutes_aws_cost_slack will be destroyed
  - resource "aws_cloudwatch_event_target" "every_five_minutes_aws_cost_slack" {
      - arn       = "arn:aws:lambda:us-east-1:589845989135:function:aws-cost-slack" -> null
      - id        = "every-five-minutes-aws-cost-slack" -> null
      - rule      = "every-five-minutes" -> null
      - target_id = "aws-cost-slack" -> null
    }

  # module.aws-cost-slack.aws_lambda_permission.allow_cloudwatch_to_call_aws_cost_slack will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_aws_cost_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-cost-slack"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + qualifier     = "aws-cost-slack"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
